{
    "status": "ok",
    "totalResults": 7280,
    "articles": [
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "1 Supercharged Growth Stock to Buy Before It Soars as Much as 222%, According to Cathie Wood's Ark Invest",
    "description": "Over the past decade, Ark Investment Management has established its niche on Wall Street by making sizable investments in disruptive and groundbreaking technologies. These include genomic research, robotics, artificial intelligence (AI), autonomous driving, a…",
    "url": "https://biztoc.com/x/498daac4d188e147",
    "urlToImage": "https://c.biztoc.com/p/498daac4d188e147/s.webp",
    "publishedAt": "2023-12-17T11:12:07Z",
    "content": "Over the past decade, Ark Investment Management has established its niche on Wall Street by making sizable investments in disruptive and groundbreaking technologies. These include genomic research, r… [+301 chars]"
    },
    {
    "source": {
    "id": "the-times-of-india",
    "name": "The Times of India"
    },
    "author": "ET CONTRIBUTORS",
    "title": "Bitcoin holds above US$42,000 as bullish sentiment continues ahead of key developments",
    "description": "The US Financial Accounting Standards Board (FASB) further contributed to the market boost by introducing new accounting regulations mandating companies like MicroStrategy, Tesla, and Block to assess their cryptocurrency holdings at fair value. Effective in 2…",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-holds-above-us42000-as-bullish-sentiment-continues-ahead-of-key-developments/articleshow/106063937.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-106063957,width-1200,height-630,imgsize-104406,overlay-etmarkets/photo.jpg",
    "publishedAt": "2023-12-17T10:53:08Z",
    "content": "At the beginning of the week, Bitcoin opened trading at the US$42,000 level but faced a surge in take-profit and sell orders, resulting in widespread market liquidations following its recent peak at … [+3722 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Security Affairs newsletter Round 450 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free for you in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Hunter…",
    "url": "https://securityaffairs.com/155997/breaking-news/security-affairs-newsletter-round-450-by-pierluigi-paganini-international-edition.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/03/newsletter.png",
    "publishedAt": "2023-12-17T09:34:44Z",
    "content": "Security Affairs newsletter Round 450 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | New NKAbuse malware abuses NKN decentralized P2P network protocol\r\n | Snatch ransomware gang claims the hack of t… [+29548 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Notebookcheck.net"
    },
    "author": "Daniel Zlatev",
    "title": "First 150 kWh semi solid-state battery range test streamed live from a NIO ET7",
    "description": "It took many months of delay, but the 150 kWh solid-state electrolyte battery pack with 600+ miles of range is now in a production ET7. None other than NIO's chief is taking it on a country trip to test the range and live streaming the experience.",
    "url": "https://www.notebookcheck.net/First-150-kWh-semi-solid-state-battery-range-test-streamed-live-from-a-NIO-ET7.784586.0.html",
    "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc4/nio-et-7-150-kwh-solid-state-battery-test.jpg",
    "publishedAt": "2023-12-17T09:21:00Z",
    "content": "NIO's CEO William Li has decided to demonstrate the real range of the company's 150 kWh semi-solid state battery pack by driving out from Shanghai until the battery dies, and streaming the whole trip… [+1776 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "BusinessLine"
    },
    "author": "S Ronendra Singh",
    "title": "Accepting Tesla’s proposals will be risky for domestic manufacturers: Kia MD",
    "description": "Indian government's potential acceptance of Tesla's proposal could be risky for domestic auto manufacturers like Tatas and Mahindras. Kia India MD on Tesla's aggressive pricing & competition.",
    "url": "https://www.thehindubusinessline.com/economy/logistics/accepting-teslas-proposals-will-be-risky-for-domestic-manufacturers-kia-md/article67647286.ece",
    "urlToImage": "https://bl-i.thgim.com/public/incoming/hktp0k/article67557026.ece/alternates/LANDSCAPE_1200/tesla.jpg",
    "publishedAt": "2023-12-17T09:12:11Z",
    "content": "The potential acceptance of Teslas proposal by the Indian government could be risky for domestic auto manufacturers like the Tatas and Mahindras as they have made large investments in developing elec… [+2450 chars]"
    },
    {
    "source": {
    "id": "fox-news",
    "name": "Fox News"
    },
    "author": "Paul Tilsley",
    "title": "Biden admin's drive for green energy leads to accusations of forced child labor mining for EV battery metals",
    "description": "The Biden administration faces a difficult balancing act in the rush for cobalt and other metals needed for batteries used by electric vehicles. Fears of child labor at the mines is one such concern.",
    "url": "https://www.foxnews.com/world/biden-admin-drive-green-energy-leads-accusations-forced-child-labor-mining-ev-battery-metals",
    "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/12/Boys-mining-for-cobalt.jpg",
    "publishedAt": "2023-12-17T09:00:08Z",
    "content": "Read this article for free!\r\nPlus get unlimited access to thousands of articles, videos and more with your free account!\r\nPlease enter a valid email address.\r\nBy entering your email, you are agreeing… [+7575 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Slashdot.org"
    },
    "author": "EditorDavid",
    "title": "Elon Musk Is Funding a New School In Austin, Texas",
    "description": "\"Associates of Elon Musk are planning to launch a new primary and secondary school,\" reports CNN, \"and ultimately a university, in Austin, Texas, with the help of a nearly $100 million donation from the billionaire, tax documents show...\"\n\nMembers of Musk's i…",
    "url": "https://news.slashdot.org/story/23/12/17/0445240/elon-musk-is-funding-a-new-school-in-austin-texas",
    "urlToImage": "https://a.fsdn.com/sd/topics/education_64.png",
    "publishedAt": "2023-12-17T08:34:00Z",
    "content": "Members of Musk's inner circle — including Jared Birchall, who runs Musk's family office — are named as leaders of The Foundation, a new school planning to teach \"STEM subjects and other topics,\" in … [+1232 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Nissan to export China-developed EVs to global markets",
    "description": "Nissan Motor said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate research and development on electrification. The Japanese automaker is c…",
    "url": "https://biztoc.com/x/078591ba33fc35d4",
    "urlToImage": "https://c.biztoc.com/p/078591ba33fc35d4/s.webp",
    "publishedAt": "2023-12-17T08:24:07Z",
    "content": "Nissan Motor said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate research and… [+287 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Zachary Shahan",
    "title": "13% of Audi Sales Electric in USA, 12% of Volkswagen & Mercedes Sales Electric — Charts",
    "description": "It’s fun and interesting to look at which automakers lead full electric vehicle (BEV) sales in the USA, and to ... [continued]\nThe post 13% of Audi Sales Electric in USA, 12% of Volkswagen & Mercedes Sales Electric — Charts appeared first on CleanTechnica.",
    "url": "https://cleantechnica.com/2023/12/17/13-of-audi-sales-electric-in-usa-12-of-volkswagen-mercedes-sales-electric/",
    "urlToImage": "https://cleantechnica.com/wp-content/uploads/2023/12/Audi-e-tron-Florida-scaled-e1702801365844.jpeg",
    "publishedAt": "2023-12-17T08:21:52Z",
    "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News!\r\nIt’s fun and interesting to look at which automakers lead full electric vehicle (BEV) sales in the USA, and t… [+3881 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Jeff Bezos is using his Amazon lessons to boost Blue Origin as it chases Elon Musk’s SpaceX",
    "description": "Jeff Bezos wants his space cargo and tourism venture Blue Origin to move faster—much faster—as Elon Musk’s SpaceX notches one win after another. The space rivalry between the two billionaires has been well documented. But in a long interview with the Lex Frid…",
    "url": "https://biztoc.com/x/627a9ef9d8d76279",
    "urlToImage": "https://c.biztoc.com/p/627a9ef9d8d76279/og.webp",
    "publishedAt": "2023-12-17T08:14:06Z",
    "content": "Jeff Bezos wants his space cargo and tourism venture Blue Origin to move fastermuch fasteras Elon Musks SpaceX notches one win after another.The space rivalry between the two billionaires has been we… [+310 chars]"
    },
    {
    "source": {
    "id": "next-big-future",
    "name": "Next Big Future"
    },
    "author": "Brian Wang",
    "title": "Tesla Megapacks Can Get Big Incentives Using Domestic Batteries",
    "description": "There is a 10% credit for energy storage with domestic content. Tesla Megapacks will have 95% domestic content. This content level will not work with CATL (China batteries). Lenders will be able to project finance energy storage like Megapacks including the 1…",
    "url": "https://www.nextbigfuture.com/2023/12/tesla-megapacks-can-get-big-incentives-using-domestic-batteries.html",
    "urlToImage": "https://nextbigfuture.s3.amazonaws.com/uploads/2023/12/Screen-Shot-2023-12-16-at-11.55.03-PM.jpg",
    "publishedAt": "2023-12-17T07:56:00Z",
    "content": "Brian Wang is a Futurist Thought Leader and a popular Science blogger with 1 million readers per month. His blog Nextbigfuture.com is ranked #1 Science News Blog. It covers many disruptive technology… [+593 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "scmp.com",
    "title": "Nissan to export China-developed EVs to global markets, plans R&D tie-up with Tsinghua University",
    "description": "A personalised news feed of stories that matter to you Get more with my NEWS Nissan to export China-developed EVs to global markets, plans R&D tie-up with Tsinghua University Nissan Motor said on Sunday it would sell China-developed electric vehicles (EVs) gl…",
    "url": "https://biztoc.com/x/dfb2e225f6ebd0ce",
    "urlToImage": "https://c.biztoc.com/p/dfb2e225f6ebd0ce/s.webp",
    "publishedAt": "2023-12-17T06:10:19Z",
    "content": "A personalised news feed of stories that matter to youGet more with my NEWSNissan to export China-developed EVs to global markets, plans R&amp;D tie-up with Tsinghua UniversityNissan Motor said on Su… [+289 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Thefreedictionary.com"
    },
    "author": null,
    "title": "Swami Vivekananda",
    "description": "Swami Vivekananda was a Hindu mystic, a disciple of Ramakrishna, and one of the most influential spiritual leaders of the Vedanta philosophy. In 1890, Vivekananda began a journey that would take him throughout India as a wandering monk. A few years later, he …",
    "url": "https://encyclopedia.thefreedictionary.com/Swami+Vivekananda",
    "urlToImage": "http://img.tfd.com/TFDlogo1200x1200.png",
    "publishedAt": "2023-12-17T05:00:00Z",
    "content": "For other uses, see Swami Vivekananda (disambiguation).\r\n\"Arise, awake, and stop not till the goal is reached\"(more in Wikiquote)\r\nSwami VivekanandaBengali: [ʃami bibekanɒnɖo], Shāmi Bibekānondo; 12 … [+63047 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "washingtonpost.com",
    "title": "Recalling almost every Tesla in America won’t fix safety issues, experts say",
    "description": "Tesla this week agreed to issue a remote update to 2 million cars aimed at improving driver attention while Autopilot is engaged, especially on surface roads with cross traffic and other hazards the driver-assistance technology is not designed to detect. Tech…",
    "url": "https://biztoc.com/x/9e36bb7d22f1f755",
    "urlToImage": "https://c.biztoc.com/p/9e36bb7d22f1f755/s.webp",
    "publishedAt": "2023-12-17T04:56:18Z",
    "content": "Tesla this week agreed to issue a remote update to 2 million cars aimed at improving driver attention while Autopilot is engaged, especially on surface roads with cross traffic and other hazards the … [+298 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Livemint"
    },
    "author": "Mint SnapView",
    "title": "Suddenly Tesla isn’t so cool anymore and must return to the drawing board",
    "description": "Could the recall of 2 million Teslas for a safety update of its autopilot software bump down its cool factor?",
    "url": "https://www.livemint.com/opinion/suddenly-tesla-isn-t-so-cool-anymore-and-must-return-to-the-drawing-board-11702788220669.html",
    "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/17/1600x900/TESLA-RECALL--0_1697560750620_1702788606635.JPG",
    "publishedAt": "2023-12-17T04:53:45Z",
    "content": "Tesla is recalling every vehicle it has ever sold in America in the period between 2012 and 2023 to install a major update to the autopilot software. This 2-million car recall was prompted by the fin… [+3922 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "The Japan Times"
    },
    "author": "The Japan Times",
    "title": "Nissan to export China-developed EVs to global markets",
    "description": "Nissan said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate research and development on electrification.",
    "url": "https://www.japantimes.co.jp/business/2023/12/17/companies/nissan-to-export-china-developed-evs/",
    "urlToImage": "https://www.japantimes.co.jp/japantimes/uploads/images/2023/12/17/269769.jpg",
    "publishedAt": "2023-12-17T04:52:00Z",
    "content": "Beijing Nissan said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate research a… [+1742 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Sputnikglobe.com"
    },
    "author": "Mary Manley",
    "title": "Elon Musk Encourages Italians to Have More Kids at Brothers of Italy Event",
    "description": "The wealthiest man in the world took to the stage after Albania’s premier Edi Rama, but ahead of UK Prime Minister Rishi Sunak. The annual event was named after a character from \"The NeverEnding Story\" – a fantasy book and movie belonging to the Italian prime…",
    "url": "https://sputnikglobe.com/20231217/elon-musk-encourages-italians-to-have-more-kids-at-brothers-of-italy-event-1115634532.html",
    "urlToImage": "https://cdn1.img.sputnikglobe.com/images/sharing/article/eng/1115634532.jpg?11156343421702788635",
    "publishedAt": "2023-12-17T04:50:37Z",
    "content": "Get the latest news from around the world, live coverage, off-beat stories, features and analysis.\r\nhttps://sputnikglobe.com/20231217/elon-musk-encourages-italians-to-have-more-kids-at-brothers-of-it… [+8195 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "aol.com",
    "title": "Tesla's recall on its Autosteer technology could bolster lawsuits claiming the feature is dangerous: report",
    "description": "None Tesla is facing several lawsuits over crashes linked to its Autosteer feature. • None The automaker this week recalled 2 million vehicles equipped with the autopilot technology. • None Plaintiffs argue the recall proves the company knew the tech was dang…",
    "url": "https://biztoc.com/x/7913f7913edbd5da",
    "urlToImage": "https://c.biztoc.com/p/7913f7913edbd5da/s.webp",
    "publishedAt": "2023-12-17T04:22:08Z",
    "content": "None Tesla is facing several lawsuits over crashes linked to its Autosteer feature.None The automaker this week recalled 2 million vehicles equipped with the autopilot technology.None Plaintiffs argu… [+280 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "New Zealand Herald"
    },
    "author": null,
    "title": "Electric vehicle owners and solar rooftops find mutual attraction",
    "description": "About 4.5 million homeowners in the US now have solar rooftops.",
    "url": "https://www.nzherald.co.nz/business/electric-vehicle-owners-and-solar-rooftops-find-mutual-attraction/CXHMJIGW4FBNVPQYNKCIKAFNHA/",
    "urlToImage": "https://www.nzherald.co.nz/resizer/7YmYtjXSl2rsD5NCa6TPx2EvohE=/1200x675/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/DJIIWRZBMNGYBF2AREQGCHMI7Y.jpg",
    "publishedAt": "2023-12-17T04:20:58Z",
    "content": "Homeowners are using solar panels to help charge their electric cars.When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive exper… [+5131 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Fark.com"
    },
    "author": null,
    "title": "Good news, rich Tesla douches -- you are now free to slaughter all the peasants you want, so long as you have $11,500 sitting around [Asinine]",
    "description": "Good news, rich Tesla douches -- you are now free to slaughter all the peasants you want, so long as you have $11,500 sitting around",
    "url": "https://www.fark.com/comments/13090076/Good-news-rich-Tesla-douches-you-are-now-free-to-slaughter-all-peasants-you-want-so-long-as-you-have-$11500-sitting-around",
    "urlToImage": "https://usrimg-full.fark.net/4/4D/fark_4DOIeuJrO4qfq3hKN5u5J0txzu8.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1702875600&Signature=CrhirBJmp5czNeErfv%2FTzeaQq9c%3D",
    "publishedAt": "2023-12-17T04:05:37Z",
    "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links… [+177 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Zacjohnson.com"
    },
    "author": "Zac Johnson",
    "title": "Elon Musk Father Net Worth – How Much is Elon Musk Father Worth?",
    "description": "Elon Musk, the CEO of Tesla and SpaceX, is undoubtedly one of the most influential and wealthy individuals in the world. However, little is known about his father, Errol Musk, and his own financial status. In this article, we delve into the net worth of Elon …",
    "url": "https://zacjohnson.com/elon-musk-father-net-worth/",
    "urlToImage": "https://zacjohnson.com/wp-content/uploads/2023/12/elon-musk-father-net-worth.jpg",
    "publishedAt": "2023-12-17T04:03:04Z",
    "content": "Elon Musk, the CEO of Tesla and SpaceX, is undoubtedly one of the most influential and wealthy individuals in the world. However, little is known about his father, Errol Musk, and his own financial s… [+20726 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "businessinsider.com",
    "title": "Tesla's recall on its Autosteer technology could bolster lawsuits claiming the feature is dangerous: report",
    "description": "Brandon Bell/Getty Images Tesla is facing several lawsuits over crashes linked to its Autosteer feature. The automaker this week recalled 2 million vehicles equipped with the autopilot technology. Plaintiffs argue the recall proves the company knew the tech w…",
    "url": "https://biztoc.com/x/1dfba789a59044f6",
    "urlToImage": "https://c.biztoc.com/p/1dfba789a59044f6/s.webp",
    "publishedAt": "2023-12-17T03:26:06Z",
    "content": "Brandon Bell/Getty ImagesTesla is facing several lawsuits over crashes linked to its Autosteer feature.The automaker this week recalled 2 million vehicles equipped with the autopilot technology.Plain… [+289 chars]"
    },
    {
    "source": {
    "id": "business-insider",
    "name": "Business Insider"
    },
    "author": "ktangalakislippert@businessinsider.com (Katherine Tangalakis-Lippert,Lloyd Lee)",
    "title": "Tesla's recall on its Autosteer technology could bolster lawsuits claiming the feature is dangerous: report",
    "description": "Tesla recalled 2 million vehicles equipped with its Autosteer feature in a move plaintiffs in a lawsuit against the automaker say proves the company knew the tech was dangerous.",
    "url": "https://www.businessinsider.com/tesla-autopilot-recall-bolsters-lawsuit-claims-the-feature-dangerous-report-2023-12",
    "urlToImage": "https://i.insider.com/657e44807a3c8094d5ddd5b0?width=1200&format=jpeg",
    "publishedAt": "2023-12-17T03:17:31Z",
    "content": "After issuing a recall this week on 2 million vehicles equipped with its autopilot technology, plaintiffs in lawsuits against Tesla argue the move proves the automaker knew its self-driving technolog… [+2282 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Slashdot.org"
    },
    "author": "feedfeeder",
    "title": "Google’s Gemini comes to more apps, Cruise slashes its workforce and Tesla issues a recall - TechCrunch",
    "description": "Google’s Gemini comes to more apps, Cruise slashes its workforce and Tesla issues a recallTechCrunch How Google Got Back on Its Feet in AI RaceThe Information Gemini support on Vertex AIGoogle Google Unveils AI Model Gemini Pro to Compete With Microsoft in th…",
    "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172510375",
    "urlToImage": null,
    "publishedAt": "2023-12-17T02:54:17Z",
    "content": "\"This generation may be the one that will face Armageddon.\"\r\n-- Ronald Reagan, \"People\" magazine, December 26, 1985"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Solar rooftops gain traction as electric vehicles owners look to skip paying for electricity or gasoline: ‘Solar just makes sense’",
    "description": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. Less than a year later, motivated to take more action to address climate change, he said, …",
    "url": "https://biztoc.com/x/628b861372f72b31",
    "urlToImage": "https://c.biztoc.com/p/628b861372f72b31/og.webp",
    "publishedAt": "2023-12-17T02:50:10Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home.Less than a year later, motivat… [+306 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Independent.ie"
    },
    "author": "Mark Tighe",
    "title": "Explorium sport and science centre to reopen four years after pandemic forced closure",
    "description": "The country’s biggest interactive sport and science centre is planning to reopen for under-eights next month and will fully reopen in March.",
    "url": "https://www.independent.ie/irish-news/explorium-sport-and-science-centre-to-reopen-four-years-after-pandemic-forced-closure/a1021610061.html",
    "urlToImage": "https://focus.independent.ie/thumbor/MHm2KRdsRbeNqEoFKmd8FjpkR5o=/101x0:1313x808/1212x808/prod-mh-ireland/546ad512-81fc-4448-ba0f-8e0e350f6c5e/48fe2dde-4251-4b1a-8f18-6f706d4e84eb/FOYER%20EXPLORIUM%20%282%29.jpg",
    "publishedAt": "2023-12-17T02:30:00Z",
    "content": "The countrys biggest interactive sport and science centre is planning to reopen for under-eights next month and will fully reopen in March. The Explorium centre in Sandyford, located in the foothills… [+4778 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CNA"
    },
    "author": null,
    "title": "Nissan to export China-developed EVs to global markets",
    "description": "BEIJING :Nissan Motor said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate research and development on electrification. The Japanese autom…",
    "url": "https://www.channelnewsasia.com/business/nissan-export-china-developed-evs-global-markets-3994511",
    "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--r7aQ9ZVY--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2023-12-17t020841z_1_lynxmpejbg00l_rtroptp_3_autos-electric-nissan-britain.jpg?itok=B4eNPxhV",
    "publishedAt": "2023-12-17T02:13:20Z",
    "content": "BEIJING :Nissan Motor said on Sunday it would sell China-developed electric vehicles (EVs) globally as it struck a deal with the country's top university to leverage local resources to accelerate res… [+1739 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Jeff Bezos, Elon Musk say human population not nearly big enough: ‘If we had a trillion humans, we would have at any given time a thousand Mozarts’",
    "description": "We need more humans. That’s the message from two of the world’s richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk. While the two compete in the space business—Bezos owns Blue Origin while Musk has SpaceX—they agree on certain aspect’s of…",
    "url": "https://biztoc.com/x/69af856e91b49f9c",
    "urlToImage": "https://c.biztoc.com/p/69af856e91b49f9c/og.webp",
    "publishedAt": "2023-12-17T01:54:13Z",
    "content": "We need more humans. Thats the message from two of the worlds richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk.While the two compete in the space businessBezos owns Blue Origin… [+284 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "tipranks.com",
    "title": "Can Tesla Stock Hit $380 in One Year? Here’s What Morgan Stanley Expects",
    "description": "Has “bad news” suddenly been redefined as “good news?” It almost seems this must be the case, when you consider that on Wednesday, the National Highway Traffic Safety Administration announced a recall of more than two million Tesla (NASDAQ:TSLA) electric cars…",
    "url": "https://biztoc.com/x/a5df34d1bc8b38c1",
    "urlToImage": "https://c.biztoc.com/p/a5df34d1bc8b38c1/og.webp",
    "publishedAt": "2023-12-17T01:26:08Z",
    "content": "Has bad news suddenly been redefined as good news? It almost seems this must be the case, when you consider that on Wednesday, the National Highway Traffic Safety Administration announced a recall of… [+282 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "aol.com",
    "title": "After viral video shows ‘built for any planet’ Cybertruck struggling on hill, Forest Service makes Tesla cheeky offer",
    "description": "Elon Musk touted the Tesla Cybertruck as the perfect vehicle for an apocalypse at a launch event in Texas a few weeks ago. And on its website, Tesla claims the futuristic electric vehicle is “built for any planet,” being “durable and rugged enough to go anywh…",
    "url": "https://biztoc.com/x/87f6e222c771d170",
    "urlToImage": "https://c.biztoc.com/p/87f6e222c771d170/s.webp",
    "publishedAt": "2023-12-17T01:20:06Z",
    "content": "Elon Musk touted the Tesla Cybertruck as the perfect vehicle for an apocalypse at a launch event in Texas a few weeks ago. And on its website, Tesla claims the futuristic electric vehicle is built fo… [+281 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Zacjohnson.com"
    },
    "author": "Zac Johnson",
    "title": "Maye Musk Net Worth – How Much is Maye Musk Worth?",
    "description": "Maye Musk, the celebrated model, dietitian, and speaker, has built a successful career spanning several industries. She has amassed a significant net worth through her various endeavors and has proven to be a formidable force in the business world. Maye Musk’…",
    "url": "https://zacjohnson.com/maye-musk-net-worth/",
    "urlToImage": "https://zacjohnson.com/wp-content/uploads/2023/12/maye-musk-net-worth.jpg",
    "publishedAt": "2023-12-17T01:07:49Z",
    "content": "Maye Musk, the celebrated model, dietitian, and speaker, has built a successful career spanning several industries. She has amassed a significant net worth through her various endeavors and has prove… [+19198 chars]"
    },
    {
    "source": {
    "id": "the-times-of-india",
    "name": "The Times of India"
    },
    "author": "Lijee Philip",
    "title": "The driving force behind EV sales: It's range, baby!",
    "description": "Tata Motors dominates the domestic EV market with its Tiago, Nexon and Tigor models, followed by MG Motor India's Comet and Mahindra & Mahindra's XUV400. The electrification wave is also capturing the luxury car segment, where Mercedes EQS has the highest cla…",
    "url": "https://economictimes.indiatimes.com/industry/renewables/the-driving-force-behind-ev-sales-its-range-baby/articleshow/106055247.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-106055334,width-1200,height-630,imgsize-100470,overlay-economictimes/photo.jpg",
    "publishedAt": "2023-12-17T01:03:12Z",
    "content": "Electric vehicles, or EVs, are steadily making their mark in India's growing passenger vehicle market.A slew of launches of several models with extended range in both the affordable and luxury catego… [+3395 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "teslarati.com",
    "title": "NHTSA head who led Tesla Autopilot investigation to step down",
    "description": "After overseeing the investigation into Tesla’s Autopilot system over the past couple of years, the acting chief of the National Highway Traffic Safety Administration (NHTSA), Ann Carlson, has announced plans to step down. Carlson has been the regulator’s chi…",
    "url": "https://biztoc.com/x/a7901da8d6110c08",
    "urlToImage": "https://c.biztoc.com/p/a7901da8d6110c08/og.webp",
    "publishedAt": "2023-12-17T00:58:06Z",
    "content": "After overseeing the investigation into Teslas Autopilot system over the past couple of years, the acting chief of the National Highway Traffic Safety Administration (NHTSA), Ann Carlson, has announc… [+276 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "teslarati.com",
    "title": "NHTSA head who led Tesla Autopilot investigation to step down",
    "description": "After overseeing the investigation into Tesla’s Autopilot system over the past couple of years, the acting chief of the National Highway Traffic Safety Administration (NHTSA), Ann Carlson, has announced plans to step down. Carlson has been the regulator’s chi…",
    "url": "https://biztoc.com/x/a7901da8d6110c08",
    "urlToImage": "https://c.biztoc.com/p/a7901da8d6110c08/og.webp",
    "publishedAt": "2023-12-17T00:58:06Z",
    "content": "After overseeing the investigation into Teslas Autopilot system over the past couple of years, the acting chief of the National Highway Traffic Safety Administration (NHTSA), Ann Carlson, has announc… [+276 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Selective Wealth Management Inc. Cuts Stock Holdings in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "Selective Wealth Management Inc. reduced its position in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 47.4% in the 3rd quarter, according to its most recent disclosure with the Securities & Exchange Commission. The institutional investor owned 1,134 s…",
    "url": "https://www.etfdailynews.com/2023/12/16/selective-wealth-management-inc-cuts-stock-holdings-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-17T00:26:49Z",
    "content": "Selective Wealth Management Inc. reduced its position in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 47.4% in the 3rd quarter, according to its most recent disclosure with the Securities &am… [+6377 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Cora Capital Advisors LLC Boosts Holdings in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "Cora Capital Advisors LLC grew its position in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 13.8% during the third quarter, according to its most recent disclosure with the Securities & Exchange Commission. The firm owned 1,023 shares of the electric …",
    "url": "https://www.etfdailynews.com/2023/12/16/cora-capital-advisors-llc-boosts-holdings-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-17T00:26:49Z",
    "content": "Cora Capital Advisors LLC grew its position in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 13.8% during the third quarter, according to its most recent disclosure with the Securities &amp; E… [+6396 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "investing.com",
    "title": "Pro Research: Wall Street eyes Enphase Energy's future By",
    "description": "Explore Wall Street's expert insights with this ProResearch article, which will exclusively be available to subscribers soon. Enhance your investment strategy with ProPicks, our newest product featuring strategies that have outperformed the S&P 500 by up to 7…",
    "url": "https://biztoc.com/x/206d5f2fe37473d7",
    "urlToImage": "https://c.biztoc.com/p/206d5f2fe37473d7/s.webp",
    "publishedAt": "2023-12-17T00:02:05Z",
    "content": "Explore Wall Street's expert insights with this ProResearch article, which will exclusively be available to subscribers soon. Enhance your investment strategy with ProPicks, our newest product featur… [+317 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Zacjohnson.com"
    },
    "author": "Zac Johnson",
    "title": "Rudy Giuliani Net Worth – How Much is Giuliani Worth?",
    "description": "Rudy Giuliani, a prominent figure in American politics and law, is no stranger to financial ups and downs. Over the years, his net worth has seen significant fluctuations, reaching impressive heights at one point but dwindling in recent times. Let’s delve int…",
    "url": "https://zacjohnson.com/rudy-giuliani-net-worth/",
    "urlToImage": "https://zacjohnson.com/wp-content/uploads/2023/12/rudy-giuliani-net-worth.jpg",
    "publishedAt": "2023-12-17T00:00:16Z",
    "content": "Rudy Giuliani, a prominent figure in American politics and law, is no stranger to financial ups and downs. Over the years, his net worth has seen significant fluctuations, reaching impressive heights… [+13701 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Zacjohnson.com"
    },
    "author": "Zac Johnson",
    "title": "Max Scherzer Net Worth – How Much is Max Scherzer Worth?",
    "description": "Max Scherzer, a seasoned American professional baseball pitcher, has an estimated net worth of $130 million as of 2023. He has played for several teams including the Arizona Diamondbacks, Detroit Tigers, Washington Nationals, Los Angeles Dodgers, and currentl…",
    "url": "https://zacjohnson.com/max-scherzer-net-worth/",
    "urlToImage": "https://zacjohnson.com/wp-content/uploads/2023/12/max-scherzer-net-worth.jpg",
    "publishedAt": "2023-12-16T23:53:15Z",
    "content": "Max Scherzer, a seasoned American professional baseball pitcher, has an estimated net worth of $130 million as of 2023. He has played for several teams including the Arizona Diamondbacks, Detroit Tig… [+20466 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Tesla, Inc. (NASDAQ:TSLA) Shares Acquired by Indiana Trust & Investment Management CO",
    "description": "Indiana Trust & Investment Management CO boosted its stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 4.2% in the third quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The firm owned 3,123 shares of…",
    "url": "https://www.etfdailynews.com/2023/12/16/tesla-inc-nasdaqtsla-shares-acquired-by-indiana-trust-investment-management-co/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T23:50:41Z",
    "content": "Indiana Trust &amp; Investment Management CO boosted its stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 4.2% in the third quarter, according to its most recent filing with the Securiti… [+5904 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Tesla, Inc. (NASDAQ:TSLA) Stake Lessened by SOA Wealth Advisors LLC.",
    "description": "SOA Wealth Advisors LLC. decreased its holdings in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 9.4% during the third quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The institutional investor owned 4…",
    "url": "https://www.etfdailynews.com/2023/12/16/tesla-inc-nasdaqtsla-stake-lessened-by-soa-wealth-advisors-llc/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T23:50:41Z",
    "content": "SOA Wealth Advisors LLC. decreased its holdings in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 9.4% during the third quarter, according to its most recent Form 13F filing with the Securities… [+6098 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "US court orders new FTC review of Illumina's Grail deal",
    "description": "Get the stock market news that is impacting trading in the US and around the world. Investing.com's stock market news team reports on before and after hours trading, earnings reports, company news and any news impacting today's major stock markets.",
    "url": "https://www.investing.com/news/stock-market-news/us-court-strikes-",
    "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
    "publishedAt": "2023-12-16T23:41:39Z",
    "content": "Elon Musk says oil and gas should not be demonisedBy Reuters - 16 hours ago6 By Francesca Landini ROME (Reuters) -Oil and gas should not be demonised in the medium-term, Elon Musk, the founder of ele… [+56 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Newser"
    },
    "author": "Bob Cronin",
    "title": "Musk, Bezos Agree: We Need More People",
    "description": "Carrying his young son onstage to illustrate his point, Elon Musk on Saturday urged the people of industrialized nations to have more children. Immigration alone can't counteract the population declines that Musk said threaten economics. Without demographic c…",
    "url": "https://www.newser.com/story/343934/musk-cultures-will-disappear-unless-birth-rates-increase.html",
    "urlToImage": "https://img1-azrcdn.newser.com/image/1507596-12-20231216175547.jpeg",
    "publishedAt": "2023-12-16T23:30:00Z",
    "content": "Carrying his young son onstage to illustrate his point, Elon Musk on Saturday urged the people of industrialized nations to have more children. Immigration alone can't counteract the population decli… [+1597 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "After viral video shows Cybertruck struggling on hill, Forest Service makes Tesla cheeky offer",
    "description": "Elon Musk touted the Tesla Cybertruck as the perfect vehicle for an apocalypse at a launch event in Texas a few weeks ago. And on its website, Tesla claims the futuristic electric vehicle is “built for any planet,” being “durable and rugged enough to go anywh…",
    "url": "https://biztoc.com/x/544fc08dde280f57",
    "urlToImage": "https://c.biztoc.com/p/544fc08dde280f57/s.webp",
    "publishedAt": "2023-12-16T23:16:06Z",
    "content": "Elon Musk touted the Tesla Cybertruck as the perfect vehicle for an apocalypse at a launch event in Texas a few weeks ago. And on its website, Tesla claims the futuristic electric vehicle is built fo… [+292 chars]"
    },
    {
    "source": {
    "id": "fortune",
    "name": "Fortune"
    },
    "author": "Steve Mollman",
    "title": "After viral video shows Cybertruck struggling on hill, Forest Service makes Tesla cheeky offer",
    "description": "The agency offered to partner with Tesla on off-road education and said \"this really happened\" to a Cybertruck at Stanislaus National Forest.",
    "url": "https://fortune.com/2023/12/16/tesla-cybertruck-struggling-spurs-forest-service-offer/",
    "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/12/GettyImages-1813811894-e1702766557699.jpg?resize=1200,600",
    "publishedAt": "2023-12-16T22:59:06Z",
    "content": "Elon Musk touted the Tesla Cybertruck as the perfect vehicle for an apocalypse at a launch event in Texas a few weeks ago. And on its website, Tesla claims the futuristic electric vehicle is built fo… [+2373 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "After viral video shows ‘built for any planet’ Cybertruck struggling on hill, Forest Service makes Tesla cheeky offer",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_64dee830-90f8-4a31-b934-a4a981a16b35",
    "urlToImage": null,
    "publishedAt": "2023-12-16T22:59:06Z",
    "content": "Si vous cliquez sur « Tout accepter », nos partenaires (y compris 241 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Finofilipino.org"
    },
    "author": "Fino",
    "title": "¿Puede hacer esto tu Tesla?",
    "description": "pic.twitter.com/CEA7GemX8j — Nut Shots (@InterestingFck) December 14, 2023\nVer post completo: ¿Puede hacer esto tu Tesla?",
    "url": "https://finofilipino.org/puede-hacer-esto-tu-tesla/",
    "urlToImage": "https://finofilipino.org/wp-content/uploads/2023/12/erfdqewrefwrtgertgf.jpg",
    "publishedAt": "2023-12-16T22:40:41Z",
    "content": "Doce cánceres de naturaleza y tipos distintos. Es más, doce cánceres en zonas radicalmente diferentes del cuerpo y mucho más. Porque el paciente tiene manchas en la piel, microcefalia y otras alterac… [+273 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Cracked.com"
    },
    "author": "Keegan Kelly",
    "title": "The Cringiest ‘Rick and Morty’ Scenes — So Far",
    "description": "The show’s subreddit selects the top times ‘Rick and Morty’ was more embarrassing than its fanbase",
    "url": "https://www.cracked.com/article_40500_the-cringiest-rick-and-morty-scenes-so-far.html",
    "urlToImage": "https://s3.crackedcdn.com/phpimages/article/7/8/0/985780.jpg",
    "publishedAt": "2023-12-16T22:00:00Z",
    "content": "Everyone familiar with Rick and Morty understands that, regardless of your evaluation of the shows quality, the series has undeniably brought a great deal of cringe into the world. Szechuan sauce, an… [+2918 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yanko Design"
    },
    "author": "Ida Torres",
    "title": "Tesla brings (scary) improvements to Gen 2 of Optimus humanoid robot",
    "description": "Tesla brings (scary) improvements to Gen 2 of Optimus humanoid robotIt’s frightening to think that it will not be a surprise to all of us if one of these days, we’ll wake up to the...",
    "url": "https://www.yankodesign.com/2023/12/16/tesla-brings-scary-improvements-to-gen-2-of-optimus-humanoid-robot/",
    "urlToImage": "https://www.yankodesign.com/images/design_news/2023/12/tesla-brings-scary-improvements-to-gen-2-of-optimus-humanoid-robot/1.jpg",
    "publishedAt": "2023-12-16T21:45:38Z",
    "content": "It’s frightening to think that it will not be a surprise to all of us if one of these days, we’ll wake up to the fact that our new robot overlords have taken over the planet. We’re seeing advances in… [+1814 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Carolyn Fortuna",
    "title": "Federal Employees: It’s Time To Commute By EV Or Public Transit",
    "description": "Federal employees, your days of driving a gas-guzzler to work solo — whether on the highways or across the bi-ways ... [continued]\nThe post Federal Employees: It’s Time To Commute By EV Or Public Transit appeared first on CleanTechnica.",
    "url": "https://cleantechnica.com/2023/12/16/federal-employees-its-time-to-commute-by-ev-or-public-transit/",
    "urlToImage": "https://cleantechnica.com/wp-content/uploads/2023/12/Washington-DC-metro.jpg",
    "publishedAt": "2023-12-16T21:34:00Z",
    "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News!\r\nFederal employees, your days of driving a gas-guzzler to work solo — whether on the highways or across the bi… [+7936 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "techcrunch.com",
    "title": "Google’s Gemini comes to more apps, Cruise slashes its workforce and Tesla issues a recall",
    "description": "Hey, folks, welcome to Week in Review (WiR), TechCrunch’s regular newsletter covering the major happenings in the tech-o-sphere — or most of them, anyway. As the world’s largest AI conference, NeurIPS, got underway in sunny New Orleans, Google shared more on …",
    "url": "https://biztoc.com/x/e5c99a661fe53bee",
    "urlToImage": "https://c.biztoc.com/p/e5c99a661fe53bee/s.webp",
    "publishedAt": "2023-12-16T21:22:07Z",
    "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunchs regular newsletter covering the major happenings in the tech-o-sphere or most of them, anyway. As the worlds largest AI conference, NeurIPS, g… [+267 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Google's Gemini comes to more apps, Cruise slashes its workforce and Tesla issues a recall",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_3852162d-2e61-4854-844e-3058856e5077",
    "urlToImage": null,
    "publishedAt": "2023-12-16T21:15:53Z",
    "content": "Si vous cliquez sur « Tout accepter », nos partenaires (y compris 241 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"
    },
    {
    "source": {
    "id": "the-times-of-india",
    "name": "The Times of India"
    },
    "author": "Bloomberg",
    "title": "​Elon Musk: Inclusion, diversity and equity are 'propaganda words'",
    "description": "​Elon Musk on Friday evening criticized diversity, equity and inclusion as \"propaganda words\" despite efforts by Tesla to promote such initiatives. The billionaire is chief executive officer and the largest shareholder of Tesla, the electric-vehicle maker whi…",
    "url": "https://timesofindia.indiatimes.com/world/us/elon-musk-inclusion-diversity-and-equity-are-propaganda-words/articleshow/106052682.cms",
    "urlToImage": "https://static.toiimg.com/thumb/msid-106052706,width-1070,height-580,imgsize-790561,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "publishedAt": "2023-12-16T20:17:47Z",
    "content": "10 foods that claim to be healthy but are not"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "washingtonpost.com",
    "title": "Tesla Autopilot recall prompts criticism from federal officials",
    "description": "Tesla this week agreed to issue a remote update to 2 million cars aimed at improving driver attention while Autopilot is engaged, especially on surface roads with cross traffic and other hazards the driver-assistance technology is not designed to detect. Tech…",
    "url": "https://biztoc.com/x/d9c3a7390597fb1c",
    "urlToImage": "https://c.biztoc.com/p/d9c3a7390597fb1c/og.webp",
    "publishedAt": "2023-12-16T20:16:18Z",
    "content": "Tesla this week agreed to issue a remote update to 2 million cars aimed at improving driver attention while Autopilot is engaged, especially on surface roads with cross traffic and other hazards the … [+300 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "aol.com",
    "title": "Jeff Bezos, Elon Musk say human population not nearly big enough: ‘If we had a trillion humans, we would have at any given time a thousand Mozarts’",
    "description": "We need more humans. That’s the message from two of the world’s richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk. While the two compete in the space business—Bezos owns Blue Origin while Musk has SpaceX—they agree on certain aspect’s of…",
    "url": "https://biztoc.com/x/0b751178fa154f3e",
    "urlToImage": "https://c.biztoc.com/p/0b751178fa154f3e/s.webp",
    "publishedAt": "2023-12-16T20:12:08Z",
    "content": "We need more humans. Thats the message from two of the worlds richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk.While the two compete in the space businessBezos owns Blue Origin… [+272 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Robb Report"
    },
    "author": "Dsimms29",
    "title": "Real Estate Mogul Craig Robins on Life in Miami, Collecting Art, and Learning to Calm Down",
    "description": "The creator of Miami's Design District was key to the revitalization of South Beach in the late 80s. Here's how he enjoys the good life.",
    "url": "https://robbreport.com/lifestyle/news/the-answers-craig-robins-1235434382/",
    "urlToImage": "https://robbreport.com/wp-content/uploads/2023/12/Robins_Answers5.jpg?w=681&h=383&crop=1",
    "publishedAt": "2023-12-16T20:00:00Z",
    "content": "It’s no secret that Miami is heating up. The balmy southern city is one of the hottest markets in the U.S.—Miami Dade’s government website says the city is projected to increase to over 3 million peo… [+4767 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Activest Wealth Management Purchases New Position in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "Activest Wealth Management bought a new stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) in the third quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund bought 1,214 shares of the electric vehicle …",
    "url": "https://www.etfdailynews.com/2023/12/16/activest-wealth-management-purchases-new-position-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T19:58:55Z",
    "content": "Activest Wealth Management bought a new stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) in the third quarter, according to its most recent disclosure with the Securities and Exchange Commi… [+6149 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "CCG Wealth Management LLC Grows Stock Holdings in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "CCG Wealth Management LLC grew its holdings in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 106.1% in the 3rd quarter, according to its most recent disclosure with the SEC. The fund owned 6,118 shares of the electric vehicle producer’s stock after pur…",
    "url": "https://www.etfdailynews.com/2023/12/16/ccg-wealth-management-llc-grows-stock-holdings-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T19:58:55Z",
    "content": "CCG Wealth Management LLC grew its holdings in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 106.1% in the 3rd quarter, according to its most recent disclosure with the SEC. The fund owned 6,1… [+6091 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "WSLS 10"
    },
    "author": "Alexa St. John",
    "title": "Electric vehicles owners and solar rooftops find mutual attraction",
    "description": "Residential solar is gaining traction in the U.S., with about 4.5 million homes now with solar rooftops.",
    "url": "https://www.wsls.com/business/2023/12/16/electric-vehicles-owners-and-solar-rooftops-find-mutual-attraction/",
    "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/ENBOMAKDRVEUHNPV45Q7EJECHE.jpg?_a=ATAPphC0",
    "publishedAt": "2023-12-16T19:55:56Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. \r\nLess than a year later, moti… [+5546 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "New England Research & Management Inc. Makes New Investment in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "New England Research & Management Inc. bought a new stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) during the third quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The fund bought 986 shares…",
    "url": "https://www.etfdailynews.com/2023/12/16/new-england-research-management-inc-makes-new-investment-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T19:26:57Z",
    "content": "New England Research &amp; Management Inc. bought a new stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) during the third quarter, according to the company in its most recent filing with th… [+6505 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Daymark Wealth Partners LLC Has $2.63 Million Stake in Tesla, Inc. (NASDAQ:TSLA)",
    "description": "Daymark Wealth Partners LLC lifted its stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 9.1% during the third quarter, according to its most recent filing with the Securities & Exchange Commission. The firm owned 10,509 shares of the electric veh…",
    "url": "https://www.etfdailynews.com/2023/12/16/daymark-wealth-partners-llc-has-2-63-million-stake-in-tesla-inc-nasdaqtsla/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/tesla-inc-logo.png?v=20221020135629&w=240&h=240&zc=2",
    "publishedAt": "2023-12-16T19:26:57Z",
    "content": "Daymark Wealth Partners LLC lifted its stake in shares of Tesla, Inc. (NASDAQ:TSLA – Free Report) by 9.1% during the third quarter, according to its most recent filing with the Securities &amp; Excha… [+6318 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Jeff Bezos, Elon Musk say human population not nearly big enough: ‘If we had a trillion humans, we would have at any given time a thousand Mozarts’",
    "description": "We need more humans. That’s the message from two of the world’s richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk. While the two compete in the space business—Bezos owns Blue Origin while Musk has SpaceX—they agree on certain aspect’s of…",
    "url": "https://biztoc.com/x/e6de19d70377d0b6",
    "urlToImage": "https://c.biztoc.com/p/e6de19d70377d0b6/og.webp",
    "publishedAt": "2023-12-16T19:20:07Z",
    "content": "We need more humans. Thats the message from two of the worlds richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk.While the two compete in the space businessBezos owns Blue Origin… [+277 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "benzinga.com",
    "title": "Elon Musk Holds Son While Highlighting Population Crisis At Italy PM Meloni's Political Event",
    "description": "At a political festival in Rome hosted by Italy's Prime Minister Giorgia Meloni on Saturday, Elon Musk, the CEO of Tesla Inc., highlighted the critical issue of Italy's declining population. The billionaire addressed the gathering with a focus on maintaining …",
    "url": "https://biztoc.com/x/aac3b80d1792f2c0",
    "urlToImage": "https://c.biztoc.com/p/aac3b80d1792f2c0/s.webp",
    "publishedAt": "2023-12-16T19:18:07Z",
    "content": "At a political festival in Rome hosted by Italy's Prime Minister Giorgia Meloni on Saturday, Elon Musk, the CEO of Tesla Inc., highlighted the critical issue of Italy's declining population.The billi… [+299 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Truthout"
    },
    "author": "Rasheed Ahmed",
    "title": "“Free-Speech Absolutist” Musk Is Abetting Modi’s Suppression of Voices in India",
    "description": "Blocking our organizations' X accounts in India is another sign of the Indian government’s attempts to stifle dissent.",
    "url": "https://truthout.org/articles/free-speech-absolutist-musk-is-abetting-modis-suppression-of-voices-in-india/",
    "urlToImage": "https://truthout.org/app/uploads/2023/12/GettyImages-1258890749.jpg",
    "publishedAt": "2023-12-16T19:09:16Z",
    "content": "Imagine waking up one morning to find out that the voice of your organization has been silenced. More uncanny is the fact that this suppression happened in the United States, a place we hold close to… [+7143 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "investors.com",
    "title": "Germany Ends Electric Vehicle Subsidies Abruptly In Latest Blow To Tesla",
    "description": "Electric vehicle subsidies are ending in Germany abruptly, the government announced Saturday, a blow for Tesla (TSLA), Volkswagen (VWAGY), BMW (BMWYY), Stellantis (STLA) and more. German's coalition government, facing a budget crisis, is ending the \"environme…",
    "url": "https://biztoc.com/x/2cd45705a08029de",
    "urlToImage": "https://c.biztoc.com/p/2cd45705a08029de/s.webp",
    "publishedAt": "2023-12-16T19:04:08Z",
    "content": "Electric vehicle subsidies are ending in Germany abruptly, the government announced Saturday, a blow for Tesla (TSLA), Volkswagen (VWAGY), BMW (BMWYY), Stellantis (STLA) and more.German's coalition g… [+284 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "yahoo.com",
    "title": "Guy Who Urged Planting a Trillion Trees Begs People to Stop Planting So Many Trees",
    "description": "But now the former chief scientific adviser for the United Nation's Trillion Trees Campaign has had a change of heart, Wired reports, pleading with environmental leaders to bring their mass tree planting to a halt. Taking the stand at this year's UN Climate C…",
    "url": "https://biztoc.com/x/835fc0c11efa18c2",
    "urlToImage": "https://c.biztoc.com/p/835fc0c11efa18c2/og.webp",
    "publishedAt": "2023-12-16T18:52:09Z",
    "content": "But now the former chief scientific adviser for the United Nation's Trillion Trees Campaign has had a change of heart, Wired reports, pleading with environmental leaders to bring their mass tree plan… [+269 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "1 Unstoppable Vanguard ETF That Could Double Your Money in 2024 and Beyond",
    "description": "Investing in the stock market is one of the easiest and most effective ways to build life-changing wealth, but choosing the right investments is critical. Some investments promise to make you rich overnight, but they carry so much risk you're likely to lose m…",
    "url": "https://biztoc.com/x/c825109124aa3c80",
    "urlToImage": "https://c.biztoc.com/p/c825109124aa3c80/s.webp",
    "publishedAt": "2023-12-16T18:52:07Z",
    "content": "Investing in the stock market is one of the easiest and most effective ways to build life-changing wealth, but choosing the right investments is critical.Some investments promise to make you rich ove… [+288 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "apnews.com",
    "title": "Electric vehicles owners and solar rooftops find mutual attraction",
    "description": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. Less than a year later, motivated to take more action to address climate change, he said, …",
    "url": "https://biztoc.com/x/72d04e1a3a5d27e1",
    "urlToImage": "https://c.biztoc.com/p/72d04e1a3a5d27e1/og.webp",
    "publishedAt": "2023-12-16T18:38:42Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home.Less than a year later, motivat… [+305 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "redmondpie.com"
    },
    "author": "Oliver Haslam",
    "title": "Tesla Cybertruck Production Is Increasing As More Vehicles Are Spotted",
    "description": "Tesla Cybertruck production is increasing as more vehicles are spotted. Here are all the details on this.\nThe post Tesla Cybertruck Production Is Increasing As More Vehicles Are Spotted first appeared on Redmond Pie.",
    "url": "https://www.redmondpie.com/tesla-cybertruck-production-is-increasing-as-more-vehicles-are-spotted/",
    "urlToImage": "https://cdn.redmondpie.com/wp-content/uploads/2023/12/image_2023-12-01_183719768.png",
    "publishedAt": "2023-12-16T18:33:22Z",
    "content": "The Tesla Cybertruck is finally on sale with early deliveries having already taken place, and there are new signs that production is finally starting to tamp up.\r\nThat could mean that actually gettin… [+1596 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "zerohedge.com",
    "title": "Even The Pope Has Something To Say About Artificial Intelligence",
    "description": "Even The Pope Has Something To Say About Artificial Intelligence Authored by Brayden Lindrea via CoinTelegraph.com, Over the past year, there’s been no shortage of scientists, tech CEOs, billionaires and lawmakers sounding the alarm over artificial intelligen…",
    "url": "https://biztoc.com/x/e72cc6cb750ee8de",
    "urlToImage": "https://c.biztoc.com/p/e72cc6cb750ee8de/s.webp",
    "publishedAt": "2023-12-16T17:54:06Z",
    "content": "Even The Pope Has Something To Say About Artificial Intelligence\r\nAuthored by Brayden Lindrea via CoinTelegraph.com,Over the past year, theres been no shortage of scientists, tech CEOs, billionaires … [+319 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "investors.com",
    "title": "Germany Ends Electric Vehicle Subsidies Abruptly In Latest Blow To Tesla",
    "description": "Germany on Saturday effectively ended electric vehicle subsidies immediately. Tesla already is losing Model 3 subsidies in France and the U.S. The post Germany Ends Electric Vehicle Subsidies Abruptly In Latest Blow To Tesla appeared first on Investor's Busin…",
    "url": "https://biztoc.com/x/c5941d1e0d209973",
    "urlToImage": "https://c.biztoc.com/265/og.png",
    "publishedAt": "2023-12-16T17:52:21Z",
    "content": "Germany on Saturday effectively ended electric vehicle subsidies immediately. Tesla already is losing Model 3 subsidies in France and the U.S. The post Germany Ends Electric Vehicle Subsidies Abruptl… [+135 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Twistedsifter.com"
    },
    "author": "Trisha Leigh",
    "title": "Elon Mush Reveals That Tesla’s Cybertruck Engineers Designed An Alternative Because They Thought The Original Design Was Awful",
    "description": "Musk says that he doesn't \"do focus groups.\"",
    "url": "http://twistedsifter.com/2023/12/elon-mush-reveals-that-teslas-cybertruck-engineers-designed-an-alternative-because-they-thought-the-original-design-was-awful/",
    "urlToImage": "https://twistedsifter.com/wp-content/uploads/2023/12/EngineersHateCybertruckDesign.jpg",
    "publishedAt": "2023-12-16T17:33:13Z",
    "content": "If we’re being completely honest, Tesla hasn’t had a whole lot of good press when it comes to their line of smart and/or self-driving cars.\r\nIt seems the Cybertruck is not going to be the automobile … [+1348 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "nypost.com",
    "title": "‘It’s everyone’s nightmare",
    "description": "It seemed like the ultimate tech dream. Want to go out to dinner? Order a robotaxi. Roadtrip? Hop in your Tesla, don’t worry, it will drive for you. But now the mixture of science fiction and marketing boosterism has collided with reality — and some in the ca…",
    "url": "https://biztoc.com/x/6c02e87eea854264",
    "urlToImage": "https://c.biztoc.com/p/6c02e87eea854264/og.webp",
    "publishedAt": "2023-12-16T17:28:15Z",
    "content": "It seemed like the ultimate tech dream.Want to go out to dinner? Order a robotaxi. Roadtrip? Hop in your Tesla, dont worry, it will drive for you.But now the mixture of science fiction and marketing … [+277 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Steve Hanley",
    "title": "Nations Begin Tightening The Screws On Chinese Electric Car Imports",
    "description": "Electric car import rules are changing in France and Turkey as 2023 comes to a close, putting Chinese imports under pressure. \nThe post Nations Begin Tightening The Screws On Chinese Electric Car Imports appeared first on CleanTechnica.",
    "url": "https://cleantechnica.com/2023/12/16/nations-begin-tightening-the-screws-on-chinese-electric-car-imports/",
    "urlToImage": "https://cleantechnica.com/wp-content/uploads/2023/07/volvo-shipping.jpg",
    "publishedAt": "2023-12-16T17:26:22Z",
    "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News!\r\nLet’s give China its due. As a nation, it has no peer at producing stuff in large quantities efficiently, tha… [+8503 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "LADbible"
    },
    "author": "Ella Scott",
    "title": "Builder who won £105m EuroMillions prize stunned neighbour with kind gesture",
    "description": "Steve Thomson won the lottery back in 2019 and proceeded to gift his client a conservatory after refusing payment.",
    "url": "https://www.ladbible.com/news/uk-news/steve-thomson-builder-euromillions-sweet-gesture-308354-20231216",
    "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/bltcd74acc1d0a99f3a/bltdec75b0e74f14c0b/657ddb4e0e1349040aa9fe83/lottery-winner.png",
    "publishedAt": "2023-12-16T17:22:49Z",
    "content": "A former EuroMillions winner once defied all odds and managed to stay humble upon collecting his prize.\r\nCast your mind back to 2019 - 42-year-old Steve Thomson had just discovered he was in for a ve… [+2630 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "futurism.com",
    "title": "Guy Who Urged Planting a Trillion Trees Begs People to Stop Planting So Many Trees",
    "description": "\"If no one had ever said, 'Plant a trillion trees,' I think we'd have been in a lot better space.\" But now the former chief scientific adviser for the United Nation's Trillion Trees Campaign has had a change of heart, Wired reports, pleading with environmenta…",
    "url": "https://biztoc.com/x/2030aeeeb0282017",
    "urlToImage": "https://c.biztoc.com/p/2030aeeeb0282017/og.webp",
    "publishedAt": "2023-12-16T17:14:10Z",
    "content": "\"If no one had ever said, 'Plant a trillion trees,' I think we'd have been in a lot better space.\"But now the former chief scientific adviser for the United Nation's Trillion Trees Campaign has had a… [+277 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Jeff Bezos, Elon Musk say human population not nearly big enough: ‘If we had a trillion humans, we would have at any given time a thousand Mozarts’",
    "description": "We need more humans. That’s the message from two of the world’s richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk. While the two compete in the space business—Bezos owns Blue Origin while Musk has SpaceX—they agree on certain aspect’s of…",
    "url": "https://biztoc.com/x/938d7c48fc1f03a3",
    "urlToImage": "https://c.biztoc.com/p/938d7c48fc1f03a3/s.webp",
    "publishedAt": "2023-12-16T17:12:06Z",
    "content": "We need more humans. Thats the message from two of the worlds richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk.While the two compete in the space businessBezos owns Blue Origin… [+277 chars]"
    },
    {
    "source": {
    "id": "fortune",
    "name": "Fortune"
    },
    "author": "Steve Mollman",
    "title": "Jeff Bezos, Elon Musk say human population not nearly big enough: ‘If we had a trillion humans, we would have at any given time a thousand Mozarts’",
    "description": "“I think in a lot of these endeavors we're very like-minded,” Bezos said of himself and Musk regarding getting humans into space.",
    "url": "https://fortune.com/2023/12/16/jeff-bezos-elon-musk-human-population-outer-space-mars-spacex-blue-origin/",
    "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/12/GettyImages-1756528978-1-e1702745851604.jpg?resize=1200,600",
    "publishedAt": "2023-12-16T17:01:19Z",
    "content": "We need more humans. Thats the message from two of the worlds richest billionaires, Amazon founder Jeff Bezos and Tesla CEO Elon Musk.While the two compete in the space businessBezos owns Blue Origin… [+3278 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Autoblog"
    },
    "author": "Bloomberg",
    "title": "These are the best electric cars for high-mileage U.S. drivers",
    "description": "Filed under:\n Green,Green Driving,Electric\n Continue reading These are the best electric cars for high-mileage U.S. drivers\nThese are the best electric cars for high-mileage U.S. drivers originally appeared on Autoblog on Sat, 16 Dec 2023 12:00:00 EST. Please…",
    "url": "https://www.autoblog.com/2023/12/16/these-are-the-best-electric-cars-for-high-mileage-u-s-drivers/",
    "urlToImage": "https://s.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/1062x597/format/jpg/quality/100/https://s.yimg.com/os/creatr-uploaded-images/2023-03/33d54370-c35e-11ed-bdf2-cd5ee6b89373",
    "publishedAt": "2023-12-16T17:00:00Z",
    "content": "For EV drivers with at-home chargers, every day begins with a full tank and little anxiety about needing to top up the cars battery. But for people who dont have access to a regular charging spot and… [+4642 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Autoblog"
    },
    "author": "Reuters",
    "title": "Top U.S. auto safety official will leave NHTSA",
    "description": "Filed under:\n Government/Legal,Hirings/Firings/Layoffs,Safety\n Continue reading Top U.S. auto safety official will leave NHTSA\nTop U.S. auto safety official will leave NHTSA originally appeared on Autoblog on Sat, 16 Dec 2023 11:30:00 EST. Please see our term…",
    "url": "https://www.autoblog.com/2023/12/16/top-u-s-auto-safety-official-will-leave-nhtsa/",
    "urlToImage": "https://s.aolcdn.com/images/dims3/GLOB/crop/350x197+0+55/resize/800x450!/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2023/12/16112411/Ann-Carlson-10-06-222.jpg",
    "publishedAt": "2023-12-16T16:30:00Z",
    "content": "WASHINGTON The acting head of the National Highway Traffic Safety Administration (NHTSA) said on Friday she is stepping down from her post after overseeing the agency's investigation into Tesla Autop… [+2404 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": null,
    "title": "Elon Musk says oil and gas should not be demonised",
    "description": "(marketscreener.com) Oil and gas should not be\ndemonised in the medium-term, Elon Musk, the founder of electric\ncar maker Tesla, said on Saturday, but he also said it\nwas important to reduce carbon emissions to preserve the planet.\n Musk, speaking at a right-…",
    "url": "https://www.marketscreener.com/quote/stock/TESLA-INC-6344549/news/Elon-Musk-says-oil-and-gas-should-not-be-demonised-45585125/",
    "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "publishedAt": "2023-12-16T16:11:19Z",
    "content": "(Adds comment on potential investment in Italy in paragraphs 7\r\nand 8, comment on advertisers coming back to X in paragraphs 10\r\nand 11)\r\nROME, Dec 16 (Reuters) - Oil and gas should not be\r\ndemonised… [+2014 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "wsj.com",
    "title": "Tesla’s Self-Driving Tech Has Competition",
    "description": "A mass recall of Tesla’s Autopilot feature and crisis at General Motors’ autonomous-taxi business might give the impression that self-driving cars have hit a roadblock. In fact, the technology is on the cusp of much wider adoption. Just don’t expect it to cha…",
    "url": "https://biztoc.com/x/94f2b237b69f6c01",
    "urlToImage": "https://c.biztoc.com/p/94f2b237b69f6c01/s.webp",
    "publishedAt": "2023-12-16T16:02:11Z",
    "content": "A mass recall of Teslas Autopilot feature and crisis at General Motors autonomous-taxi business might give the impression that self-driving cars have hit a roadblock. In fact, the technology is on th… [+229 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Autoblog"
    },
    "author": "Insider",
    "title": "Elon Musk is cracking under the pressure of the biggest gamble he's ever taken in his life",
    "description": "Filed under:\n Insurance,Ownership,Safety,SUV,Luxury\n Continue reading Elon Musk is cracking under the pressure of the biggest gamble he's ever taken in his life\nElon Musk is cracking under the pressure of the biggest gamble he's ever taken in his life origina…",
    "url": "https://www.autoblog.com/2023/12/16/elon-musk-is-cracking-under-the-pressure-of-the-biggest-gamble-he-s-ever-taken-in-his-life/",
    "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/1062x597/format/jpg/quality/100/https://media.zenfs.com/en/insider_articles_922/a330e68cbe7d202c69cb07e8f1a0bc0f",
    "publishedAt": "2023-12-16T16:00:00Z",
    "content": "Elon Musk was on a hot streak.\r\nFrom 2019 to 2022, it seemed as if every gamble that Musk took was paying off. Tesla was consistently profitable for the first time in its history and its stock soared… [+11979 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "investing.com",
    "title": "Oil and gas should not be demonized, Elon Musk says",
    "description": "It is important to reduce carbon emissions to preserve the planet, but oil and should not be demonized in the medium-term, Elon Musk, the founder of electric car maker Tesla (NASDAQ: ), said on Saturday. Earlier this week representatives from nearly 200 count…",
    "url": "https://biztoc.com/x/a8154226dd4a5b3b",
    "urlToImage": "https://c.biztoc.com/p/a8154226dd4a5b3b/s.webp",
    "publishedAt": "2023-12-16T15:52:06Z",
    "content": "It is important to reduce carbon emissions to preserve the planet, but oil and should not be demonized in the medium-term, Elon Musk, the founder of electric car maker Tesla (NASDAQ: ), said on Satur… [+257 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "cnbc.com",
    "title": "Recent data shows AI job losses are rising, but the numbers don't tell the full story",
    "description": "Elon Musk, chief executive officer of Tesla Inc., during a fireside discussion on artificial intelligence risks with Rishi Sunak, UK prime minister, not pictured, in London, UK, on Thursday, Nov. 2, 2023. Elon Musk insists artificial intelligence will get hum…",
    "url": "https://biztoc.com/x/75be29c86e53784a",
    "urlToImage": "https://c.biztoc.com/p/75be29c86e53784a/og.webp",
    "publishedAt": "2023-12-16T15:34:08Z",
    "content": "Elon Musk, chief executive officer of Tesla Inc., during a fireside discussion on artificial intelligence risks with Rishi Sunak, UK prime minister, not pictured, in London, UK, on Thursday, Nov. 2, … [+297 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Elon Musk calls diversity, equity, inclusion 'morally wrong' propaganda words for racism, sexism: 'Changing the target class doesn’t make it right'",
    "description": "Elon Musk on Friday evening criticized Diversity, Equity and Inclusion as “propaganda words” despite efforts by Tesla Inc. to promote such initiatives. The billionaire is chief executive officer and the largest shareholder of Tesla, the electric-vehicle maker…",
    "url": "https://biztoc.com/x/e3f2b8398c4180bd",
    "urlToImage": "https://c.biztoc.com/p/e3f2b8398c4180bd/s.webp",
    "publishedAt": "2023-12-16T15:34:06Z",
    "content": "Elon Musk on Friday evening criticized Diversity, Equity and Inclusion as propaganda words despite efforts by Tesla Inc. to promote such initiatives.The billionaire is chief executive officer and the… [+274 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Slashdot.org"
    },
    "author": "feedfeeder",
    "title": "Fewer Electric Vehicles Will Qualify for Federal Tax Credits in 2024 - The New York Times",
    "description": "Fewer Electric Vehicles Will Qualify for Federal Tax Credits in 2024The New York Times Tesla Model 3 may lose $7500 tax credit in 2024 under new battery rulesArs Technica Top EVs are losing tax credits next year as U.S. boots China from supply chain–these sto…",
    "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172505921",
    "urlToImage": null,
    "publishedAt": "2023-12-16T15:34:00Z",
    "content": "\"Kill the Wabbit, Kill the Wabbit, Kill the Wabbit!\"\r\n-- Looney Tunes, \"What's Opera Doc?\" (1957, Chuck Jones)"
    },
    {
    "source": {
    "id": "fortune",
    "name": "Fortune"
    },
    "author": "Dana Hull, Bloomberg",
    "title": "Elon Musk calls diversity, equity, inclusion 'morally wrong' propaganda words for racism, sexism: 'Changing the target class doesn’t make it right'",
    "description": "Tesla recently stated, “From day one during onboarding, employees are exposed to our Diversity, Equity and Inclusion (DEI) principles.\"",
    "url": "https://fortune.com/2023/12/16/elon-musk-calls-diversity-equity-inclusion-propaganda/",
    "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/12/GettyImages-1852467043-e1702740325192.jpg?resize=1200,600",
    "publishedAt": "2023-12-16T15:27:09Z",
    "content": "Elon Musk on Friday evening criticized Diversity, Equity and Inclusion as propaganda words despite efforts by Tesla Inc. to promote such initiatives.The billionaire is chief executive officer and the… [+1966 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "nytimes.com",
    "title": "Fewer Electric Vehicles Will Qualify for Federal Tax Credits in 2024",
    "description": "Tesla has warned on its website that the least expensive Model 3 sedan and a long-range version will no longer qualify for federal tax credits after Dec. 31. The cars have a battery made in China. Purchases of popular models like the Tesla Model 3 and the For…",
    "url": "https://biztoc.com/x/3c2b54dc34804a95",
    "urlToImage": "https://c.biztoc.com/p/3c2b54dc34804a95/og.webp",
    "publishedAt": "2023-12-16T15:20:11Z",
    "content": "Tesla has warned on its website that the least expensive Model 3 sedan and a long-range version will no longer qualify for federal tax credits after Dec. 31. The cars have a battery made in China.Pur… [+284 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "cnbc.com",
    "title": "Recent data shows AI job losses are rising, but the numbers don't tell the full story",
    "description": "Elon Musk, chief executive officer of Tesla Inc., during a fireside discussion on artificial intelligence risks with Rishi Sunak, UK prime minister, not pictured, in London, UK, on Thursday, Nov. 2, 2023. Elon Musk insists artificial intelligence will get hum…",
    "url": "https://biztoc.com/x/762bc75172775dc0",
    "urlToImage": "https://c.biztoc.com/p/762bc75172775dc0/s.webp",
    "publishedAt": "2023-12-16T15:12:08Z",
    "content": "Elon Musk, chief executive officer of Tesla Inc., during a fireside discussion on artificial intelligence risks with Rishi Sunak, UK prime minister, not pictured, in London, UK, on Thursday, Nov. 2, … [+297 chars]"
    },
    {
    "source": {
    "id": "the-washington-post",
    "name": "The Washington Post"
    },
    "author": "Faiz Siddiqui",
    "title": "Tesla Autopilot recall prompts criticism from federal officials",
    "description": "Tesla’s software update addresses “insufficient” driver monitoring for Autopilot — but the fixes don’t stop drivers from misusing the technology.",
    "url": "https://www.washingtonpost.com/technology/2023/12/16/tesla-autopilot-recall/",
    "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XCQAZB2T25P3YS73T2LCP4LACE.JPG&w=1440",
    "publishedAt": "2023-12-16T15:10:55Z",
    "content": "Comment on this story\r\nComment\r\nAdd to your saved stories\r\nSave\r\nTesla this week agreed to issue a remote update to 2 million cars aimed at improving driver attention while Autopilot is engaged, espe… [+8015 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "wsj.com",
    "title": "Tesla’s Self-Driving Tech Has Competition",
    "description": "A mass recall of Tesla’s Autopilot feature and crisis at General Motors’ autonomous-taxi business might give the impression that self-driving cars have hit a roadblock. In fact, the technology is on the cusp of much wider adoption. Just don’t expect it to cha…",
    "url": "https://biztoc.com/x/fc926e7870beaa30",
    "urlToImage": "https://c.biztoc.com/p/fc926e7870beaa30/s.webp",
    "publishedAt": "2023-12-16T15:04:07Z",
    "content": "A mass recall of Teslas Autopilot feature and crisis at General Motors autonomous-taxi business might give the impression that self-driving cars have hit a roadblock. In fact, the technology is on th… [+229 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Solar rooftops gain traction as electric vehicles owners look to skip paying for electricity or gasoline: ‘Solar just makes sense’",
    "description": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. Less than a year later, motivated to take more action to address climate change, he said, …",
    "url": "https://biztoc.com/x/fecb9330a1a7a00e",
    "urlToImage": "https://c.biztoc.com/p/fecb9330a1a7a00e/s.webp",
    "publishedAt": "2023-12-16T15:04:05Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home.Less than a year later, motivat… [+306 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "New York Post"
    },
    "author": "Joshua Rhett Miller",
    "title": "‘It’s everyone’s nightmare — the robot doesn’t stop’: Tesla recall and robotaxi crash throw self-driving car dream into crisis",
    "description": "A San Francisco robotaxi called Panini dragged a woman for 20 feet leaving her critically injured. Are self-driving cars toast?",
    "url": "https://nypost.com/2023/12/16/lifestyle/tesla-recall-robotaxi-crash-cause-self-driving-car-crisis/",
    "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/12/rumba-auto-car.gif?w=1024",
    "publishedAt": "2023-12-16T15:00:00Z",
    "content": "It seemed like the ultimate tech dream.\r\nWant to go out to dinner? Order a robotaxi. Roadtrip? Hop in your Tesla, don’t worry, it will drive for you.\r\nBut now the mixture of science fiction and marke… [+12260 chars]"
    },
    {
    "source": {
    "id": "fortune",
    "name": "Fortune"
    },
    "author": "Alexa St. John, The Associated Press",
    "title": "Solar rooftops gain traction as electric vehicles owners look to skip paying for electricity or gasoline: ‘Solar just makes sense’",
    "description": "Residential solar is gaining traction in the U.S., with about 4.5 million homes now with solar rooftops.",
    "url": "https://fortune.com/2023/12/16/solar-rooftops-gain-electric-vehicles-owners-skip-paying-for-electricity-gasoline/",
    "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/12/AP23349541550576-e1702738137376.jpg?resize=1200,600",
    "publishedAt": "2023-12-16T14:54:05Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home.Less than a year later, motivat… [+5181 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Zacjohnson.com"
    },
    "author": "Zac Johnson",
    "title": "Biggest Net Worth – How Much is Biggest Worth?",
    "description": "The global list of billionaires according to Forbes reveals the individuals with the biggest net worth in the world. These billionaires play a significant role in shaping the global economy and have amassed vast fortunes through their business ventures. Key T…",
    "url": "https://zacjohnson.com/biggest-net-worth/",
    "urlToImage": "https://zacjohnson.com/wp-content/uploads/2023/12/biggest-net-worth.jpg",
    "publishedAt": "2023-12-16T14:31:41Z",
    "content": "The global list of billionaires according to Forbes reveals the individuals with the biggest net worth in the world. These billionaires play a significant role in shaping the global economy and have … [+23282 chars]"
    },
    {
    "source": {
    "id": "associated-press",
    "name": "Associated Press"
    },
    "author": "Alexa St. John",
    "title": "Electric vehicles owners and solar rooftops find mutual attraction",
    "description": "Residential solar is gaining traction in the U.S., with about 4.5 million homes now with solar rooftops. The share of electric vehicles in the U.S. is also growing. Many people with EVs become interested in charging them on solar energy, if they own their own…",
    "url": "https://apnews.com/article/electric-vehicles-rooftop-solar-environment-climate-595238a55e13a7153af34788f8d61465",
    "urlToImage": "https://dims.apnews.com/dims4/default/59a0ed8/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fd7%2Fed6f5b2b3ca027ea9dfe3e3db83f%2F7a6c78d683de4cf68538d57c8e59396b",
    "publishedAt": "2023-12-16T14:25:01Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. \r\nLess than a year later, moti… [+5387 chars]"
    },
    {
    "source": {
    "id": "abc-news",
    "name": "ABC News"
    },
    "author": "ALEXA ST. JOHN Associated Press",
    "title": "Electric vehicles owners and solar rooftops find mutual attraction",
    "description": "Residential solar is gaining traction in the U.S., with about 4.5 million homes now with solar rooftops",
    "url": "https://abcnews.go.com/Business/wireStory/electric-vehicles-owners-solar-rooftops-find-mutual-attraction-105712637",
    "urlToImage": "https://i.abcnewsfe.com/a/62f90fa5-e5c6-4ff4-b431-cc8b19dc741c/wirestory_595238a55e13a7153af34788f8d61465_16x9.jpg?w=992",
    "publishedAt": "2023-12-16T14:22:32Z",
    "content": "When Jim Selgo moved to his home in Goodyear, Arizona in 2019, he quickly had rooftop solar installed, having had a positive experience with solar at his previous home. \r\nLess than a year later, moti… [+5393 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "abnormalreturns.com",
    "title": "Saturday links: hospitality and sophistication",
    "description": "EVs The rising pedestrian death rate is due to a rise in nighttime deaths. (nytimes.com) The Tesla ($TSLA) Cybertruck is another step along the line of increasingly large, dangerous vehicles. (slate.com) Ford ($F) is cutting F-150 Lightning production. (arste…",
    "url": "https://biztoc.com/x/0bbe58c08ed9d1f7",
    "urlToImage": "https://c.biztoc.com/265/og.png",
    "publishedAt": "2023-12-16T14:18:10Z",
    "content": "EVsThe rising pedestrian death rate is due to a rise in nighttime deaths. (nytimes.com)The Tesla ($TSLA) Cybertruck is another step along the line of increasingly large, dangerous vehicles. (slate.co… [+286 chars]"
    },
    {
    "source": {
    "id": "the-times-of-india",
    "name": "The Times of India"
    },
    "author": "Reuters",
    "title": "Oil and gas should not be demonized: Elon Musk",
    "description": "It is important to reduce carbon emissions to preserve the planet, but oil and natural gas should not be demonized in the medium-term, Elon Musk said on Saturday. Earlier this week representatives from nearly 200 countries agreed at the COP28 climate summit t…",
    "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/oil-and-gas-should-not-be-demonized-elon-musk/articleshow/106049976.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-106049928,width-1200,height-630,imgsize-18540,overlay-economictimes/photo.jpg",
    "publishedAt": "2023-12-16T14:16:43Z",
    "content": "It is important to reduce carbon emissions to preserve the planet, but oil and natural gas should not be demonized in the medium-term, Elon Musk, the founder of electric car maker Tesla, said on Satu… [+831 chars]"
    }
    ]
    }